#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.aws_cloudfront_cache_policy.cache_policy_cloudfront: Reading...[0m[0m
[0m[1mdata.aws_canonical_user_id.current: Reading...[0m[0m
[0m[1mdata.aws_cloudfront_cache_policy.cache_policy_cloudfront: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6][0m
[0m[1mdata.aws_canonical_user_id.current: Read complete after 1s [id=5a9437fb2ae7861477507b95308f7eec09cb8add867a31798428a738958bdf7d][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_cloudfront_cache_policy.this-cdn-ordered-cache-policy[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_cloudfront_cache_policy" "this-cdn-ordered-cache-policy" {
      [32m+[0m [0m[1m[0mdefault_ttl[0m[0m = 31556952
      [32m+[0m [0m[1m[0metag[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mmax_ttl[0m[0m     = 31556952
      [32m+[0m [0m[1m[0mmin_ttl[0m[0m     = 31556952
      [32m+[0m [0m[1m[0mname[0m[0m        = "CAW-aws-aps1-prod-cloudfront-Terraform_demo-Gzip_cache_policy_cloudfront"

      [32m+[0m [0mparameters_in_cache_key_and_forwarded_to_origin {
          [32m+[0m [0m[1m[0menable_accept_encoding_gzip[0m[0m = true

          [32m+[0m [0mcookies_config {
              [32m+[0m [0m[1m[0mcookie_behavior[0m[0m = "none"

              [32m+[0m [0mcookies {}
            }

          [32m+[0m [0mheaders_config {
              [32m+[0m [0m[1m[0mheader_behavior[0m[0m = "none"

              [32m+[0m [0mheaders {}
            }

          [32m+[0m [0mquery_strings_config {
              [32m+[0m [0m[1m[0mquery_string_behavior[0m[0m = "none"

              [32m+[0m [0mquery_strings {}
            }
        }
    }

[1m  # aws_cloudfront_distribution.this-cdn-portal[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_cloudfront_distribution" "this-cdn-portal" {
      [32m+[0m [0m[1m[0marn[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mcaller_reference[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mdomain_name[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0menabled[0m[0m                        = true
      [32m+[0m [0m[1m[0metag[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mhosted_zone_id[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mhttp_version[0m[0m                   = "http2"
      [32m+[0m [0m[1m[0mid[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0min_progress_validation_batches[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mis_ipv6_enabled[0m[0m                = true
      [32m+[0m [0m[1m[0mlast_modified_time[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprice_class[0m[0m                    = "PriceClass_All"
      [32m+[0m [0m[1m[0mretain_on_delete[0m[0m               = false
      [32m+[0m [0m[1m[0mstatus[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                           = {
          [32m+[0m [0m"app-name"               = "portal-cloudfront"
          [32m+[0m [0m"app-role"               = "Cloudfront distribution for s3"
          [32m+[0m [0m"security-accessibility" = "Public"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                       = {
          [32m+[0m [0m"app-environment"        = "Dev"
          [32m+[0m [0m"app-name"               = "portal-cloudfront"
          [32m+[0m [0m"app-role"               = "Cloudfront distribution for s3"
          [32m+[0m [0m"info-created_by"        = "Aayush"
          [32m+[0m [0m"info-purpose"           = "Development"
          [32m+[0m [0m"info-terraform"         = "yes"
          [32m+[0m [0m"org"                    = "CAW Studios"
          [32m+[0m [0m"org-cost-center"        = "CAW Studios"
          [32m+[0m [0m"org-owner"              = "aayushbajaj505@gmail.com"
          [32m+[0m [0m"org-team"               = "devops"
          [32m+[0m [0m"security-accessibility" = "Public"
        }
      [32m+[0m [0m[1m[0mtrusted_key_groups[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mtrusted_signers[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mwait_for_deployment[0m[0m            = false

      [32m+[0m [0mdefault_cache_behavior {
          [32m+[0m [0m[1m[0mallowed_methods[0m[0m        = [
              [32m+[0m [0m"GET",
              [32m+[0m [0m"HEAD",
            ]
          [32m+[0m [0m[1m[0mcache_policy_id[0m[0m        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          [32m+[0m [0m[1m[0mcached_methods[0m[0m         = [
              [32m+[0m [0m"GET",
              [32m+[0m [0m"HEAD",
            ]
          [32m+[0m [0m[1m[0mcompress[0m[0m               = true
          [32m+[0m [0m[1m[0mdefault_ttl[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mmax_ttl[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mmin_ttl[0m[0m                = 0
          [32m+[0m [0m[1m[0mtarget_origin_id[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mtrusted_key_groups[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mtrusted_signers[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mviewer_protocol_policy[0m[0m = "allow-all"
        }

      [32m+[0m [0morigin {
          [32m+[0m [0m[1m[0mconnection_attempts[0m[0m = 3
          [32m+[0m [0m[1m[0mconnection_timeout[0m[0m  = 10
          [32m+[0m [0m[1m[0mdomain_name[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0morigin_id[0m[0m           = (known after apply)
        }

      [32m+[0m [0mrestrictions {
          [32m+[0m [0mgeo_restriction {
              [32m+[0m [0m[1m[0mlocations[0m[0m        = (known after apply)
              [32m+[0m [0m[1m[0mrestriction_type[0m[0m = "none"
            }
        }

      [32m+[0m [0mviewer_certificate {
          [32m+[0m [0m[1m[0mcloudfront_default_certificate[0m[0m = true
          [32m+[0m [0m[1m[0mminimum_protocol_version[0m[0m       = "TLSv1"
        }
    }

[1m  # aws_s3_bucket.this-s3-bucket[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket" "this-s3-bucket" {
      [32m+[0m [0m[1m[0macceleration_status[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0macl[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0marn[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mbucket[0m[0m                      = "CAW-aws-aps1-prod-s3-Terraform_demo-terrafrom_demo"
      [32m+[0m [0m[1m[0mbucket_domain_name[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mbucket_regional_domain_name[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m               = true
      [32m+[0m [0m[1m[0mhosted_zone_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mobject_lock_enabled[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpolicy[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mrequest_payer[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                        = {
          [32m+[0m [0m"app-name"               = "terrafrom_demo-S3-Bucket"
          [32m+[0m [0m"app-role"               = "s3 Bucket"
          [32m+[0m [0m"security-accessibility" = "Private"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                    = {
          [32m+[0m [0m"app-environment"        = "Dev"
          [32m+[0m [0m"app-name"               = "terrafrom_demo-S3-Bucket"
          [32m+[0m [0m"app-role"               = "s3 Bucket"
          [32m+[0m [0m"info-created_by"        = "Aayush"
          [32m+[0m [0m"info-purpose"           = "Development"
          [32m+[0m [0m"info-terraform"         = "yes"
          [32m+[0m [0m"org"                    = "CAW Studios"
          [32m+[0m [0m"org-cost-center"        = "CAW Studios"
          [32m+[0m [0m"org-owner"              = "aayushbajaj505@gmail.com"
          [32m+[0m [0m"org-team"               = "devops"
          [32m+[0m [0m"security-accessibility" = "Private"
        }
      [32m+[0m [0m[1m[0mwebsite_domain[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mwebsite_endpoint[0m[0m            = (known after apply)

      [32m+[0m [0mcors_rule {
          [32m+[0m [0m[1m[0mallowed_headers[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mallowed_methods[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mallowed_origins[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mexpose_headers[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mmax_age_seconds[0m[0m = (known after apply)
        }

      [32m+[0m [0mgrant {
          [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mpermissions[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0muri[0m[0m         = (known after apply)
        }

      [32m+[0m [0mlifecycle_rule {
          [32m+[0m [0m[1m[0mabort_incomplete_multipart_upload_days[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0menabled[0m[0m                                = (known after apply)
          [32m+[0m [0m[1m[0mid[0m[0m                                     = (known after apply)
          [32m+[0m [0m[1m[0mprefix[0m[0m                                 = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m                                   = (known after apply)

          [32m+[0m [0mexpiration {
              [32m+[0m [0m[1m[0mdate[0m[0m                         = (known after apply)
              [32m+[0m [0m[1m[0mdays[0m[0m                         = (known after apply)
              [32m+[0m [0m[1m[0mexpired_object_delete_marker[0m[0m = (known after apply)
            }

          [32m+[0m [0mnoncurrent_version_expiration {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }

          [32m+[0m [0mnoncurrent_version_transition {
              [32m+[0m [0m[1m[0mdays[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mstorage_class[0m[0m = (known after apply)
            }

          [32m+[0m [0mtransition {
              [32m+[0m [0m[1m[0mdate[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mdays[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mstorage_class[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mlogging {
          [32m+[0m [0m[1m[0mtarget_bucket[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtarget_prefix[0m[0m = (known after apply)
        }

      [32m+[0m [0mobject_lock_configuration {
          [32m+[0m [0m[1m[0mobject_lock_enabled[0m[0m = (known after apply)

          [32m+[0m [0mrule {
              [32m+[0m [0mdefault_retention {
                  [32m+[0m [0m[1m[0mdays[0m[0m  = (known after apply)
                  [32m+[0m [0m[1m[0mmode[0m[0m  = (known after apply)
                  [32m+[0m [0m[1m[0myears[0m[0m = (known after apply)
                }
            }
        }

      [32m+[0m [0mreplication_configuration {
          [32m+[0m [0m[1m[0mrole[0m[0m = (known after apply)

          [32m+[0m [0mrules {
              [32m+[0m [0m[1m[0mdelete_marker_replication_status[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
              [32m+[0m [0m[1m[0mprefix[0m[0m                           = (known after apply)
              [32m+[0m [0m[1m[0mpriority[0m[0m                         = (known after apply)
              [32m+[0m [0m[1m[0mstatus[0m[0m                           = (known after apply)

              [32m+[0m [0mdestination {
                  [32m+[0m [0m[1m[0maccount_id[0m[0m         = (known after apply)
                  [32m+[0m [0m[1m[0mbucket[0m[0m             = (known after apply)
                  [32m+[0m [0m[1m[0mreplica_kms_key_id[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mstorage_class[0m[0m      = (known after apply)

                  [32m+[0m [0maccess_control_translation {
                      [32m+[0m [0m[1m[0mowner[0m[0m = (known after apply)
                    }

                  [32m+[0m [0mmetrics {
                      [32m+[0m [0m[1m[0mminutes[0m[0m = (known after apply)
                      [32m+[0m [0m[1m[0mstatus[0m[0m  = (known after apply)
                    }

                  [32m+[0m [0mreplication_time {
                      [32m+[0m [0m[1m[0mminutes[0m[0m = (known after apply)
                      [32m+[0m [0m[1m[0mstatus[0m[0m  = (known after apply)
                    }
                }

              [32m+[0m [0mfilter {
                  [32m+[0m [0m[1m[0mprefix[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mtags[0m[0m   = (known after apply)
                }

              [32m+[0m [0msource_selection_criteria {
                  [32m+[0m [0msse_kms_encrypted_objects {
                      [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
                    }
                }
            }
        }

      [32m+[0m [0mserver_side_encryption_configuration {
          [32m+[0m [0mrule {
              [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m = (known after apply)

              [32m+[0m [0mapply_server_side_encryption_by_default {
                  [32m+[0m [0m[1m[0mkms_master_key_id[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0msse_algorithm[0m[0m     = (known after apply)
                }
            }
        }

      [32m+[0m [0mversioning {
          [32m+[0m [0m[1m[0menabled[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mmfa_delete[0m[0m = (known after apply)
        }

      [32m+[0m [0mwebsite {
          [32m+[0m [0m[1m[0merror_document[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mindex_document[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mredirect_all_requests_to[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mrouting_rules[0m[0m            = (known after apply)
        }
    }

[1m  # aws_s3_bucket.this-s32-bucket[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket" "this-s32-bucket" {
      [32m+[0m [0m[1m[0macceleration_status[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0macl[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0marn[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mbucket[0m[0m                      = "CAW-aws-aps1-prod-s3-terrafrom_demo"
      [32m+[0m [0m[1m[0mbucket_domain_name[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mbucket_regional_domain_name[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m               = true
      [32m+[0m [0m[1m[0mhosted_zone_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mobject_lock_enabled[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpolicy[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mrequest_payer[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                        = {
          [32m+[0m [0m"app-name"               = "terrafrom_demo-S3-Bucket"
          [32m+[0m [0m"app-role"               = "s3 Bucket"
          [32m+[0m [0m"security-accessibility" = "Private"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                    = {
          [32m+[0m [0m"app-environment"        = "Dev"
          [32m+[0m [0m"app-name"               = "terrafrom_demo-S3-Bucket"
          [32m+[0m [0m"app-role"               = "s3 Bucket"
          [32m+[0m [0m"info-created_by"        = "Aayush"
          [32m+[0m [0m"info-purpose"           = "Development"
          [32m+[0m [0m"info-terraform"         = "yes"
          [32m+[0m [0m"org"                    = "CAW Studios"
          [32m+[0m [0m"org-cost-center"        = "CAW Studios"
          [32m+[0m [0m"org-owner"              = "aayushbajaj505@gmail.com"
          [32m+[0m [0m"org-team"               = "devops"
          [32m+[0m [0m"security-accessibility" = "Private"
        }
      [32m+[0m [0m[1m[0mwebsite_domain[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mwebsite_endpoint[0m[0m            = (known after apply)

      [32m+[0m [0mcors_rule {
          [32m+[0m [0m[1m[0mallowed_headers[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mallowed_methods[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mallowed_origins[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mexpose_headers[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mmax_age_seconds[0m[0m = (known after apply)
        }

      [32m+[0m [0mgrant {
          [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mpermissions[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0muri[0m[0m         = (known after apply)
        }

      [32m+[0m [0mlifecycle_rule {
          [32m+[0m [0m[1m[0mabort_incomplete_multipart_upload_days[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0menabled[0m[0m                                = (known after apply)
          [32m+[0m [0m[1m[0mid[0m[0m                                     = (known after apply)
          [32m+[0m [0m[1m[0mprefix[0m[0m                                 = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m                                   = (known after apply)

          [32m+[0m [0mexpiration {
              [32m+[0m [0m[1m[0mdate[0m[0m                         = (known after apply)
              [32m+[0m [0m[1m[0mdays[0m[0m                         = (known after apply)
              [32m+[0m [0m[1m[0mexpired_object_delete_marker[0m[0m = (known after apply)
            }

          [32m+[0m [0mnoncurrent_version_expiration {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }

          [32m+[0m [0mnoncurrent_version_transition {
              [32m+[0m [0m[1m[0mdays[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mstorage_class[0m[0m = (known after apply)
            }

          [32m+[0m [0mtransition {
              [32m+[0m [0m[1m[0mdate[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mdays[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mstorage_class[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mlogging {
          [32m+[0m [0m[1m[0mtarget_bucket[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtarget_prefix[0m[0m = (known after apply)
        }

      [32m+[0m [0mobject_lock_configuration {
          [32m+[0m [0m[1m[0mobject_lock_enabled[0m[0m = (known after apply)

          [32m+[0m [0mrule {
              [32m+[0m [0mdefault_retention {
                  [32m+[0m [0m[1m[0mdays[0m[0m  = (known after apply)
                  [32m+[0m [0m[1m[0mmode[0m[0m  = (known after apply)
                  [32m+[0m [0m[1m[0myears[0m[0m = (known after apply)
                }
            }
        }

      [32m+[0m [0mreplication_configuration {
          [32m+[0m [0m[1m[0mrole[0m[0m = (known after apply)

          [32m+[0m [0mrules {
              [32m+[0m [0m[1m[0mdelete_marker_replication_status[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
              [32m+[0m [0m[1m[0mprefix[0m[0m                           = (known after apply)
              [32m+[0m [0m[1m[0mpriority[0m[0m                         = (known after apply)
              [32m+[0m [0m[1m[0mstatus[0m[0m                           = (known after apply)

              [32m+[0m [0mdestination {
                  [32m+[0m [0m[1m[0maccount_id[0m[0m         = (known after apply)
                  [32m+[0m [0m[1m[0mbucket[0m[0m             = (known after apply)
                  [32m+[0m [0m[1m[0mreplica_kms_key_id[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mstorage_class[0m[0m      = (known after apply)

                  [32m+[0m [0maccess_control_translation {
                      [32m+[0m [0m[1m[0mowner[0m[0m = (known after apply)
                    }

                  [32m+[0m [0mmetrics {
                      [32m+[0m [0m[1m[0mminutes[0m[0m = (known after apply)
                      [32m+[0m [0m[1m[0mstatus[0m[0m  = (known after apply)
                    }

                  [32m+[0m [0mreplication_time {
                      [32m+[0m [0m[1m[0mminutes[0m[0m = (known after apply)
                      [32m+[0m [0m[1m[0mstatus[0m[0m  = (known after apply)
                    }
                }

              [32m+[0m [0mfilter {
                  [32m+[0m [0m[1m[0mprefix[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mtags[0m[0m   = (known after apply)
                }

              [32m+[0m [0msource_selection_criteria {
                  [32m+[0m [0msse_kms_encrypted_objects {
                      [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
                    }
                }
            }
        }

      [32m+[0m [0mserver_side_encryption_configuration {
          [32m+[0m [0mrule {
              [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m = (known after apply)

              [32m+[0m [0mapply_server_side_encryption_by_default {
                  [32m+[0m [0m[1m[0mkms_master_key_id[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0msse_algorithm[0m[0m     = (known after apply)
                }
            }
        }

      [32m+[0m [0mversioning {
          [32m+[0m [0m[1m[0menabled[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mmfa_delete[0m[0m = (known after apply)
        }

      [32m+[0m [0mwebsite {
          [32m+[0m [0m[1m[0merror_document[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mindex_document[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mredirect_all_requests_to[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mrouting_rules[0m[0m            = (known after apply)
        }
    }

[1m  # aws_s3_bucket_acl.this-s3-acl_policy[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_acl" "this-s3-acl_policy" {
      [32m+[0m [0m[1m[0mbucket[0m[0m = "CAW-aws-aps1-prod-s3-Terraform_demo-terrafrom_demo"
      [32m+[0m [0m[1m[0mid[0m[0m     = (known after apply)

      [32m+[0m [0maccess_control_policy {
          [32m+[0m [0mgrant {
              [32m+[0m [0m[1m[0mpermission[0m[0m = "READ"

              [32m+[0m [0mgrantee {
                  [32m+[0m [0m[1m[0mdisplay_name[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mtype[0m[0m         = "Group"
                  [32m+[0m [0m[1m[0muri[0m[0m          = "http://acs.amazonaws.com/groups/global/AllUsers"
                }
            }
          [32m+[0m [0mgrant {
              [32m+[0m [0m[1m[0mpermission[0m[0m = "READ_ACP"

              [32m+[0m [0mgrantee {
                  [32m+[0m [0m[1m[0mdisplay_name[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mtype[0m[0m         = "Group"
                  [32m+[0m [0m[1m[0muri[0m[0m          = "http://acs.amazonaws.com/groups/global/AllUsers"
                }
            }
          [32m+[0m [0mgrant {
              [32m+[0m [0m[1m[0mpermission[0m[0m = "READ"

              [32m+[0m [0mgrantee {
                  [32m+[0m [0m[1m[0mdisplay_name[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mid[0m[0m           = "5a9437fb2ae7861477507b95308f7eec09cb8add867a31798428a738958bdf7d"
                  [32m+[0m [0m[1m[0mtype[0m[0m         = "CanonicalUser"
                }
            }
          [32m+[0m [0mgrant {
              [32m+[0m [0m[1m[0mpermission[0m[0m = "READ_ACP"

              [32m+[0m [0mgrantee {
                  [32m+[0m [0m[1m[0mdisplay_name[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mid[0m[0m           = "5a9437fb2ae7861477507b95308f7eec09cb8add867a31798428a738958bdf7d"
                  [32m+[0m [0m[1m[0mtype[0m[0m         = "CanonicalUser"
                }
            }
          [32m+[0m [0mgrant {
              [32m+[0m [0m[1m[0mpermission[0m[0m = "WRITE"

              [32m+[0m [0mgrantee {
                  [32m+[0m [0m[1m[0mdisplay_name[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mid[0m[0m           = "5a9437fb2ae7861477507b95308f7eec09cb8add867a31798428a738958bdf7d"
                  [32m+[0m [0m[1m[0mtype[0m[0m         = "CanonicalUser"
                }
            }
          [32m+[0m [0mgrant {
              [32m+[0m [0m[1m[0mpermission[0m[0m = "WRITE_ACP"

              [32m+[0m [0mgrantee {
                  [32m+[0m [0m[1m[0mdisplay_name[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mid[0m[0m           = "5a9437fb2ae7861477507b95308f7eec09cb8add867a31798428a738958bdf7d"
                  [32m+[0m [0m[1m[0mtype[0m[0m         = "CanonicalUser"
                }
            }

          [32m+[0m [0mowner {
              [32m+[0m [0m[1m[0mdisplay_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mid[0m[0m           = "5a9437fb2ae7861477507b95308f7eec09cb8add867a31798428a738958bdf7d"
            }
        }
    }

[1m  # aws_s3_bucket_policy.this-s3-policy[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_policy" "this-s3-policy" {
      [32m+[0m [0m[1m[0mbucket[0m[0m = "CAW-aws-aps1-prod-s3-Terraform_demo-terrafrom_demo"
      [32m+[0m [0m[1m[0mid[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mpolicy[0m[0m = jsonencode(
            {
              [32m+[0m [0mId        = "PolicyForCloudFrontPrivateContent"
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "s3:GetObject"
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = "*"
                      [32m+[0m [0mResource  = "arn:aws:s3:::CAW-aws-aps1-prod-s3-Terraform_demo-terrafrom_demo/*"
                      [32m+[0m [0mSid       = "AddPerm"
                    },
                ]
              [32m+[0m [0mVersion   = "2008-10-17"
            }
        )
    }

[1m  # aws_s3_bucket_website_configuration.this-s3-website-configuration[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_website_configuration" "this-s3-website-configuration" {
      [32m+[0m [0m[1m[0mbucket[0m[0m           = "CAW-aws-aps1-prod-s3-Terraform_demo-terrafrom_demo"
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrouting_rules[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mwebsite_domain[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mwebsite_endpoint[0m[0m = (known after apply)

      [32m+[0m [0merror_document {
          [32m+[0m [0m[1m[0mkey[0m[0m = "index.html"
        }

      [32m+[0m [0mindex_document {
          [32m+[0m [0m[1m[0msuffix[0m[0m = "index.html"
        }

      [32m+[0m [0mrouting_rule {
          [32m+[0m [0mcondition {
              [32m+[0m [0m[1m[0mhttp_error_code_returned_equals[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mkey_prefix_equals[0m[0m               = (known after apply)
            }

          [32m+[0m [0mredirect {
              [32m+[0m [0m[1m[0mhost_name[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0mhttp_redirect_code[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0mprotocol[0m[0m                = (known after apply)
              [32m+[0m [0m[1m[0mreplace_key_prefix_with[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mreplace_key_with[0m[0m        = (known after apply)
            }
        }
    }

[0m[1mPlan:[0m 7 to add, 0 to change, 0 to destroy.
[0m
```

</details>

*Pusher: @AayushbajajCAW, Action: `pull_request`, Working Directory: ``, Workflow: `Deploy infra using Terraform`*